Repository: waylybaye/XcodeCleaner-SwiftUI
Catalog: Cleaner4Xcode/*.lproj/Localizable.strings
Languages: pt_br, th, zh_hans

# sidebar.welcome
source: Welcome
pt_br: Bem Vindo
th: หน้าแรก
zh_hans: 欢迎

source: test I18N
zh_hans: 测试 I18N

# welcome.need_authorize
source: Need ~/Library/Developer permission to analyze and clean Xcode files.
pt_br: É necessário acesso a pasta ~/Library/Developer para analisar e limpar arquivos Xcode.
th: ต้องการสิทธิ์ในการเข้าถึง ~/Library/Developer เพื่อวิเคราะห์และทำล้างข้อมูลของ Xcode ที่ไม่จำเป็น
zh_hans: 需要您对 ~/Library/Developer 进行授权才可以分析该文件夹

# welcome.button_analyze
source: Analyze
pt_br: Analizar
th: วิเคราะห์
zh_hans: 开始分析

# welcome.button_analyze_again
source: Try Again
pt_br: Tentar Novamente
th: ลองอีกครั้ง
zh_hans: 再来一遍

# welcome.button_change_location
source: Change Developer Location
pt_br: Mudar pasta Developer
th: เลือกโฟลเดอร์ Developer ใหม่
zh_hans: 选择其它目录

# copy_command_title
source: Copy command
zh_hans: 复制命令

# analysis.iOSDeviceSupport.summary
source: Only need to keep the latest iOS version, feel free to remove old versions.
pt_br: Só precisa manter a última versão do iOS, fique à vontade para remover as versões antigas.
th: iOS เวอร์ชั่นล่าสุดเท่านั้นที่จะถูกใช้ คุณสามารถลบเวอร์ชั่นเก่าได้
zh_hans: iOS 真机调试文件，设备通过 USB 连接时会自动生成对应系统版本的调试信息，只需要保留您持有的设备当前的最新版本即可。

# analysis.watchOSDeviceSupport.summary
source: Only need to keep the latest watchOS version, feel free to remove old versions.
pt_br: Só precisa manter a versão mais recente do watchOS, fique à vontade para remover as versões antigas.
th: watchOS เวอร์ชั่นล่าสุดเท่านั้นที่จะถูกใช้ คุณสามารถลบเวอร์ชั่นเก่าได้
zh_hans: watchOS 真机调试文件，设备通过 USB 连接时会自动生成对应系统版本的调试信息，只需要保留您持有的设备当前的最新版本即可。

# analysis.archives.summary
source: You can't debug deployed versions if you remove old archives.
pt_br: Você não pode depurar versões implantadas se remover arquivos antigos.
th: ถ้าคุณลบ archives เก่า คุณอาจไม่สามารถกลับมา Debug เวอร์ชั่นที่ถูกปล่อยไปแล้วได้
zh_hans: 应用每个版本的归档文件，收集到崩溃日志后需要其中的 dSYM 文件来定位源代码，dSYM 也可以通过开发者后台来下载，所以根据个人需要决定是否保留。

# analysis.simulators.summary
source: Your apps' data are stored here. I suggest you run `xcrun simctl delete unavailable` to reduce the size safely.
pt_br: Os dados de seus aplicativos são armazenados aqui. É sugerido executar `xcrun simctl delete unavailable` para reduzir o tamanho com segurança.
th: apps' data ของคุณเก็บไว้ที่นี่ ฉันแนะนำว่าคุณควรรันคำสั่ง `xcrun simctl delete unavailable` แทน เพื่อลบไฟล์อย่างปลอดภัย
zh_hans: 模拟器中安装应用的数据保存在这里，建议使用 `xcrun simctl delete unavailable` 自动清理。

# analysis.derivedData.summary
source: It's safe to clear the entire folder, but you'll need to rebuild your projects after removal.
pt_br: É seguro limpar a pasta inteira, mas você precisará rebuildar seus projetos após a remoção.
th: โฟลเดอร์นี้สามารถลบทิ้ง ทั้งโฟลเดอร์ได้อย่างปลอดภัย คุณเพียงสั่ง rebuild โปรเจคของคุณอีกครั้ง ทุกอย่างก็จะกลับมาปรกติ
zh_hans: 项目的一些索引及缓存文件，可以安全删除，删除后再次打开项目时会自动重新生成。

# analysis.previews.summary
source: SwiftUI Previews simulator and data. I suggest you run `xcrun simctl --set previews delete unavailable` to reduce the size safely.
pt_br: Dados e SwiftUI simulator Previews
th: SwiftUI Previews simulator and data
zh_hans: SwiftUI 预览的模拟器和数据，建议使用 `xcrun simctl --set previews delete unavailable` 自动清理。

# analysis.simulatorCaches.summary
source: Simulator runtime caches
pt_br: Simulator caches de runtime
zh_hans: 模拟器运行时的缓存文件

# xcode_not_found_title
source: Xcode not found
pt_br: Xcode não encontrado
th: ไม่พบ Xcode
zh_hans: 未能在指定目录中找到 Xcode

# xcode_not_found_body
source: No Xcode installation found in selected Developer directory, it's usually at ~/Library/Developer.
pt_br: Nenhuma instalação do Xcode encontrada na pasta Developer selecionada, normalmente em ~/Library/Developer.
th: ไม่พบการติดตั้ง Xcode ในโฟลเดอร์ Developer ที่เลือก ตามปรกติแล้ว ควรอยู่ที่ ~/Library/Developer
zh_hans: 未能在指定目录中找到 Xcode，Developer 目录一般在 ~/Library/Developer 目录下

# developer_auth_title
source: Choose Developer Directory
pt_br: Escolha a pasta Developer
th: เลือกโฟลเดอร์ Developer
zh_hans: 选择 Developer 目录

# developer_auth_tip
source: Please choose Developer directory，you can use ⌘ ⇧ G and input ~/Library/Developer
pt_br: Favor escolher a pasta Developer，você pode usar ⌘ ⇧ G e colocar ~/Library/Developer
th: โปรดเลือกโฟลเดอร์ Developer คุณสามารถกด ⌘ ⇧ G และระบุโฟลเดอร์ลงไปว่า ~/Library/Developer
zh_hans: 请选择 Developer 目录，您可以使用快捷键 ⌘ ⇧ G 调出“前往”输入框并且输入 ~/Library/Developer
